Belesprit26/gs_firmware/sdkconfig.defaults
# ── Target ─────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32c6"

# ── Flash (Seeed XIAO ESP32-C6 = 4 MB) ────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# ── BLE (NimBLE) ──────────────────────────────────────────────────
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
# Secure Connections only — legacy pairing keys are recoverable by a
# passive sniffer, and provisioning writes WiFi creds + refresh token +
# owner key over this link.
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=y

# ── WiFi ──────────────────────────────────────────────────────────
CONFIG_ESP_WIFI_ENABLED=y

# ── NVS ───────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── Watchdog ──────────────────────────────────────────────────────
# The control tasks (sensor/scheduler/button) subscribe to the TWDT and
# feed it once per loop iteration.  Timeout must exceed the slowest loop
# (scheduler: 30 s), hence 60 s.  PANIC=y so an expiry reboots the chip —
# relay GPIO is low (OFF) through boot, which is the safe direction.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
CONFIG_ESP_TASK_WDT_PANIC=y

# ── OTA ───────────────────────────────────────────────────────────
# App rollback: a freshly-OTA'd image boots in "pending verify" and is
# reverted by the bootloader unless the app calls
# esp_ota_mark_app_valid_cancel_rollback() (done in ota.c once the image
# is confirmed healthy).  Protects against bricking on a bad update.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ── Partition table ───────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── Logging ───────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
